Ludovich88/Robo-ZB-SR2CH10A/sdkconfig.defaults
# ESP32-C6 Smart Relay Default Configuration

# Target Configuration
CONFIG_IDF_TARGET="esp32c6"
CONFIG_IDF_TARGET_ESP32C6=y

# CPU Configuration
CONFIG_ESP32C6_DEFAULT_CPU_FREQ_160=y
CONFIG_ESP32C6_DEFAULT_CPU_FREQ_MHZ=160

# Flash Configuration
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# PSRAM Configuration
CONFIG_ESP32C6_SPIRAM_SUPPORT=n

# UART Configuration
CONFIG_ESP_CONSOLE_UART_NUM=0
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# WiFi Configuration (disabled for Zigbee only)
CONFIG_ESP_WIFI_ENABLED=n

# Bluetooth Configuration (disabled for Zigbee only)
CONFIG_BT_ENABLED=n
CONFIG_BT_BLUEDROID_ENABLED=n

# Zigbee Configuration
CONFIG_ESP_ZB_ENABLED=y
CONFIG_ESP_ZB_ROUTER_ROLE=y
CONFIG_ESP_ZB_ED_ROLE=y

# Logging Configuration
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3

# FreeRTOS Configuration
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS=y

# GPIO Configuration
CONFIG_GPIO_ESP32_SUPPORT_SWITCH_MATRIX=y

# UART Driver Configuration
CONFIG_UART_USE_RUNTIME_ISR=y
CONFIG_UART_ISR_IN_IRAM=y

# NVS Configuration (simplified for ESP32-C6)
CONFIG_NVS_ENCRYPTION=n
CONFIG_NVS_SECURITY_ENABLED=n
